app/controllers/events_controller.rb

  def index
    @events = @person.events.pay_period_with_offset(@offset)
    unless @events.empty?
---
SELECT * FROM "events" WHERE ("events".person_id = 14) AND ((time BETWEEN '2010-02-01 05:00:00' AND '2010-02-16 05:00:00') AND ("events".person_id = 14)) ORDER BY time ASC LIMIT 1
SELECT count(*) AS count_all FROM "events" WHERE (((time BETWEEN '2010-02-01 05:00:00' AND '2010-02-16 05:00:00') AND ("events".person_id = 14)) AND ("events".person_id = 14))